tasks={}
tasks_id=1

while True:
    print("\nСписок Дел")
    print("1. Добавить задачу")
    print("2. Показать все задачи")
    print("3. Удалить задачу")
    print("4. Выйти")
    
    choice=int(input("Выберите действие (1-4):"))
    
    if choice ==1:
        task=input("Введите задачу:")
        tasks[tasks_id] = task
        print(f"✅ Задача '{task}' добавлена под номером {tasks_id}.")
        tasks_id+=1
    
    elif choice ==2:
        if not tasks:
            print("📭 Список задач пуст.")
        else:
            print("\nВаши задачи:")
            for id,task in tasks.items():
                print(f"{id}. {task}")
    
    elif choice==3:
        if not tasks:
            print("❌ Нет задач для удаления.")
        else:
            try:
                delete_id=int(input("Введите номер задачи для удаления: "))
                if delete_id in tasks:
                    removed=tasks.pop(delete_id)
                    print(f"🗑 Задача '{removed}' удалена.")
                else:
                    print("⚠️ Задачи с таким номером нет.")
            except ValueError:
                print("⚠️ Введите корректный номер задачи.")
    elif choice==4:
        print("👋 Выход из программы. До встречи!")
        break
    else:
        print("⚠️ Неверный выбор. Попробуйте снова.")